{"intents": [
    {"tag": "greetings",
    "patterns": ["hello", "hi", "hey", "good day", "greetings", "whats up"],
    "responses": ["Hello!", "Hi user, how can I help?", "Hey, how can I help?"]
},
{"tag": "goodbye",
    "patterns": ["cya",
      "See you later",
      "Goodbye",
      "I am Leaving",
      "Have a Good day",
      "bye",
      "see ya"],
    "responses": ["Sad to see you go",
      "Talk to you later",
      "Goodbye!"],
    "context_set": ""
  },
  {"tag": "Fire Alarm",
    "patterns": ["I want a new fire alarm",
                "what kind of fire alarms do you have in at the moment?", 
                "What kind of fire alarm products do Ei offer?"],
    "responses": ["We have many different types of Fire alarm her at E. I. Depending on the room you want to protect we have four different Alarm types. Please ask me about them. The types are Optical, Multi-Sensor, Ionisation and Heat Alarms."],
    "context_set": ""
  },
  {"tag": "Optical Alarm",
    "patterns": ["What is an Optical Alarm?",
      "Tell me about the optical alarm",
      "What does an optical alarm detect?"],
    "responses": ["Optical alarms are best for detecting slow, smouldering fires.Optical Smoke Alarms should be used in living rooms, circulation areas and escape routes as well as in bedrooms. An optical alarm we recommend is our model 3016."],
    "context_set": ""
  },
  {"tag": "Multi Sensor Alarm",
    "patterns": ["What is a Multi Sensor Alarm?",
      "Tell me about the multi sensor alarms",
      "What does a multi sesnor alarm detect?"],
    "responses": ["Best protection due to optimum fire response – using heat and optical sensors. Multi-Sensor Alarms should be used in living rooms, circulation areas and escape routes. Our most popular multi sensor alarm is the 3024."],
    "context_set": ""
  },
  {"tag": "Ionasation Alarm",
    "patterns": ["What is an Ionisaion Alarm?",
      "Tell me about your ionisation alarms",
      "What does an ionisation alarm detect?"],
    "responses": ["Fast reaction to fast flaming fires. This alarm is most suitable for bedrooms. Our 141RC is our most popular ionisation alarm."],
    "context_set": ""
  },
  {"tag": "Heat Alarm",
    "patterns": ["What is a heat Alarm?",
      "Tell me about your heat alarms",
      "What does a heat alarm alarm detect?"],
    "responses": ["Reacts to heat and is resistant to kitchen fumes such as burnt toast. Heat Alarms should be used in kitchen areas as other sensor types are more likely to go into alarm. Our 3014 unit is our newest heat alarm. Alternatively we have a 3028 unit which detects both heat an c. o."],
    "context_set": ""
  },
  {"tag": "The Gateway",
    "patterns": ["What is the gateway?",
      "Tell me about the gateway",
      "What does the gateway do?"],
    "responses": ["The gateway is a management tool for fire and co alarm installations. It is smart link compatiable and can send email or sms notificstions to you, the user. It comes equipped with an easy use dashboard and tracks alarm performance. This product is made to make your life generally easier."],
    "context_set": ""
  },
  {"tag": "Audio-Link",
    "patterns": ["What is audio link?",
      "Tell me about audio link",
      "What is the purpose of audio link?"],
    "responses": ["Our Award winning AudioLINK technology makes it easy to get real-time data from alarms – saving time, money and lives. All you need is an AudioLINK enabled alarm, a smartphone or tablet and the free AudioLINK App."],
    "context_set": ""
  },
  {"tag": "Smart-Link",
    "patterns": ["What is smart link?",
      "Tell me about smart link",
      "What is the purpose of smart link?"],
    "responses": ["Our Award winning AudioLINK technology makes it easy to get real-time data from alarms – saving time, money and lives. All you need is an AudioLINK enabled alarm, a smartphone or tablet and the free AudioLINK App. With help from our gateway, smart Link enables notification of alarm events via a cloud based portal system, allowing notifications via email or text as well as full visibility of your connected SmartLINK systems"],
    "context_set": ""
  },
  {"tag": "Radio-Link",
    "patterns": ["What is radio link?",
      "Tell me about radio link",
      "What is the purpose of radio link?"],
    "responses": ["RadioLINK wireless interconnection technology uses radio frequency (RF) signals to wirelessly link alarms together with added functionality.  Interconnecting alarms is vital so that occupants can hear the alarm throughout the property. RadioLINK+ has the added benefit of whole system data extraction and monitoring."],
    "context_set": ""
  },
  {"tag": "Delivery",
    "patterns": ["How long does delivery take?",
      "Tell me about the delivery times"],
    "responses": ["Delivery on our products depend on where you buy them from. We are constantly making units in our factory to try keep stocks in stores high."],
    "context_set": ""
  },
  {"tag": "The company",
    "patterns": ["Tell me about the company",
      "Tell me about E. I. Electronics"],
    "responses": ["Employing over 1000 people worldwide, we are headquartered in Shannon, Ireland, where all key Manufacturing and Commercial functions are centred. Our business has expanded significantly over our 30 year history and today we rank as one of Ireland’s leading indigenous electronics manufacturing and exporting companies."],
    "context_set": ""
  },
  {"tag": "Eco friendly",
    "patterns": ["Tell me about the companies carbon footprint",
      "Tell me about E. I. Electronics zero carbon project"],
    "responses": ["Employing over 1000 people worldwide, we are headquartered in Shannon, Ireland, where all key Manufacturing and Commercial functions are centred. Our business has expanded significantly over our 30 year history and today we rank as one of Ireland’s leading indigenous electronics manufacturing and exporting companies."],
    "context_set": ""
  }
]}

